# |-|-| lytic bot |-|-|
# -*- coding: utf-8 -*-

#  BlackSmith plugin
#  tv_plugin.py

# Coded by: WitcherGeralt (WitcherGeralt@jabber.ru)
# http://witcher-team.ucoz.ru/

def handler_tv_ya(type, source, channel):
	if channel:
		if check_number(channel):
			try:
				lines, repl = read_url('http://tv.yandex.ru/?mode=print&channel=%s' % (channel), 'Mozilla/5.0').splitlines(), ''
#				lines, repl = read_url('http://tv.yandex.ru.sixxs.org/?mode=print&channel=%s' % (channel), 'Mozilla/5.0').splitlines(), ''
				for line in lines:
					if line.find('<div>') != -1:
						if re.search('<.*?>\d', line):
							repl += '\n'+replace_all(line, ['\n', '<div>', '<b>', '</div>', '</b>'], '')
				if not repl:
					repl = u'Нет программы на сегодня!'
				else:
					repl = unicode(repl, 'UTF-8')
			except:
				repl = u'Не вышло...'
		else:
			repl = u'Пиши номер канала в листе (команда: "тв_лист")'
	else:
		repl = u'Программа какого канала нужна?'
	reply(type, source, repl)

def handler_tvlist(type, source, body):
	try:
#		list, repl = read_url('http://tv.yandex.ru/', 'Mozilla/5.0').splitlines(), ''
		list_channel, repl = read_url('http://tv.yandex.ru?channel=692,646,556,258,277,227,214,697,219,220,211,221,651,226,224,223,295,208,376,259,228,568,628,629,683,229,294,284,218,636,549,230,689,681,233,501,288,552,289,231,698,324,325,685,213,553,632,554,621,696,216,623,663,659,541,584,212,201,666,448,298,291,585,557,655,558,550,622,631,650,504,202,447,630,204,369,530,203,595,326,658,540,657,222,940,207,887,586,620,292,662,455,665,563,432,682,205,677,945,949,950,951,952,953,954,955,956,958,959,960,961,962,963,964,967,968,969,980,981,985,986,987,989,990,991,992,993,994,996,997,998,999,1000,1001,1003,1004,1005,1008,1009,1010,1011,1013,1014,1015,1016,1017,1018,1021,1022,1023,1024,1026,1028,1029,1030,1035,1036,1044,1057,1058,1059,1060,1061,1062,1063,1064,1065,1066,1068,1069,1070,1071,1072,1073,1074,1075,1076,1077,1078,1080,1083,1093,1094,1099,1102,1105,1106,1110,1114,1115,1128,1134,1150,1151,1160,1175,1177,1178,1179,1209,1216,1238,1247,332,1259,290,1261,660,1276,1277,1284,1285,1286,1287,1288,503,984,1296,1299,1306,1297,1314,1027,1339,1352,1353,1354,1355,1356,293,1081,528,529,329,661,206,1019,1025,1170,560,1173,1391,672,215,555,1468,1079,1294,1037,1482,1161,1485,1275,1488,1493,1494,1495,400', 'Mozilla/5.0').splitlines(), ''
#		list_channel, repl = read_url('http://tv.yandex.ru.sixxs.org?channel=692,646,556,258,277,227,214,697,219,220,211,221,651,226,224,223,295,208,376,259,228,568,628,629,683,229,294,284,218,636,549,230,689,681,233,501,288,552,289,231,698,324,325,685,213,553,632,554,621,696,216,623,663,659,541,584,212,201,666,448,298,291,585,557,655,558,550,622,631,650,504,202,447,630,204,369,530,203,595,326,658,540,657,222,940,207,887,586,620,292,662,455,665,563,432,682,205,677,945,949,950,951,952,953,954,955,956,958,959,960,961,962,963,964,967,968,969,980,981,985,986,987,989,990,991,992,993,994,996,997,998,999,1000,1001,1003,1004,1005,1008,1009,1010,1011,1013,1014,1015,1016,1017,1018,1021,1022,1023,1024,1026,1028,1029,1030,1035,1036,1044,1057,1058,1059,1060,1061,1062,1063,1064,1065,1066,1068,1069,1070,1071,1072,1073,1074,1075,1076,1077,1078,1080,1083,1093,1094,1099,1102,1105,1106,1110,1114,1115,1128,1134,1150,1151,1160,1175,1177,1178,1179,1209,1216,1238,1247,332,1259,290,1261,660,1276,1277,1284,1285,1286,1287,1288,503,984,1296,1299,1306,1297,1314,1027,1339,1352,1353,1354,1355,1356,293,1081,528,529,329,661,206,1019,1025,1170,560,1173,1391,672,215,555,1468,1079,1294,1037,1482,1161,1485,1275,1488,1493,1494,1495,400', 'Mozilla/5.0').splitlines(), ''
		channel = ''
		for channel in list_channel:
#			if channel.find('<option value="') != -1:
			if channel.count('<option value="') > 0:
#				repl += '\n'+replace_all(channel, {'">': '.', '<option value="': '', '\n': '', '\t': '', '\r': '', '</option>': '', '</select>': '', '</td>': '', '&amp;': ' '})
				repl += '\n'+replace_all(channel, {'">': '.', '<option value="': '', '\n': '', '\t': '', '\r': '', '</option>': '', '</select>': '', '</td>': '', '&amp;': ' '})
		if repl:
			if type == 'public':
				reply(type, source, u'Глянь в приват')
			reply('private', source, unicode(repl, 'UTF-8'))
		else:
			reply(type, source, u'Не могу достать список')
	except:
		reply(type, source, u'Не вышло')

register_command_handler(handler_tv_ya, 'тв', ['все','инфо'], 10, 'Показать телепрограму', 'тв № канала', ['тв 325'])
register_command_handler(handler_tvlist, 'тв_лист', ['все','инфо'], 10, 'Просмотреть список номеров каналов', 'тв_лист', ['тв_лист'])
